# Едно ловно куче е на N стъпки след бягащ заек. Напишете програма dog, която изчислява след колко скока ловното куче ще настигне бягащия заек, ако за всеки скок заекът изминава M стъпки, а кучето К стъпки.
#
#
# От първия ред на стандартния вход се въвеждат три цели положителни числа N, M, K.
#
#
# Програмата извежда на единствения ред на стандартния изход едно цяло число – броя на скоковете, които трябва да направи ловното куче, за да настигне бягащия заек.

n, m, k = map(int, input().split())
i = 0
while True:
    if n + m * i <= k * i:
        print(i)
        break
    i += 1
